app/controllers/users_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL ORDER BY `users`.`id` ASC LIMIT 1
---
  def index
    @users = case params[:status]
             when 'deleted'
               User.only_deleted
             when 'archived'
               User.archived
             when 'unarchived'
               User.unarchived
             else
               User.all

SELECT `users`.* FROM `users` WHERE `users`.`deleted_at` IS NULL AND `users`.`id` IS NULL LIMIT 1
---
  def set_user
    @user = User.find_by(id: params[:id])