app/models/user.rb

UPDATE `users` SET `users`.`updated_at` = '2021-07-02 00:00:27.695399', `users`.`is_archived` = TRUE WHERE `users`.`id` = 1
---
  def archive!
    self.update(is_archived: true)

UPDATE `users` SET `users`.`updated_at` = '2021-07-02 00:06:11.077736', `users`.`is_archived` = FALSE WHERE `users`.`id` = 2
---
  def unarchive!
    self.update(is_archived: false)